# BuiltInFailures.RevisionFailures Class

---
Failures about Revision Settings.
SystemObject Autodesk.Revit.DBBuiltInFailuresRevisionFailures
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public static class RevisionFailures

    Public NotInheritable Class RevisionFailures

    public ref class RevisionFailures abstract sealed

    [<AbstractClassAttribute>]
    [<SealedAttribute>]
    type RevisionFailures = class end
The BuiltInFailuresRevisionFailures type exposes the following members.
| Name| Description
---|---|---
| RevisionSettingsDuplicateName|  More than one Revisons have the same name %1!s!.
Top
#### Reference
Autodesk.Revit.DB Namespace